# CannotGetSketchReferences Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..CannotGetSketchReferences Property
BuiltInFailures..::..SketchFailures Class See Also
---
Cannot find references to dimension sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotGetSketchReferences { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotGetSketchReferences As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotGetSketchReferences {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace